In [1]:
import pandas as pd

In [2]:
S1_alameda = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_alameda.xlsx", header=None)

In [3]:
S1_alamo = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_alamo.xlsx", header=None)

In [4]:
S1_berkley = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_berkley.xlsx", header=None)

In [5]:
S1_crockett = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_crockett.xlsx", header=None)

In [6]:
S1_danville = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_danville.xlsx", header=None)

In [7]:
S1_hercules = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_hercules .xlsx", header=None)

In [8]:
S1_leandro = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_leandro.xlsx", header=None)

In [9]:
S1_lorenzo = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_lorenzo.xlsx", header=None)

In [10]:
S1_moraga = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_moraga .xlsx", header=None)

In [11]:
S1_oakland_a1 = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_oakland_a1.xlsx", header=None)

In [12]:
S1_oakland_a2 = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_oakland_a2.xlsx", header=None)

In [13]:
S1_oakland_a3 = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_oakland_a3.xlsx", header=None)

In [14]:
S1_oakland_b1 = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_oakland_b1.xlsx", header=None)

In [15]:
S1_oakland_b2 = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_oakland_b2.xlsx", header=None)

In [16]:
S1_oakland_b3 = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_oakland_b3.xlsx", header=None)

In [17]:
S1_orinda = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_orinda .xlsx", header=None)

In [18]:
S1_pablo = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_pablo .xlsx", header=None)

In [19]:
S1_richmond = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_richmond.xlsx", header=None)

In [20]:
S1_selby = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_selby.xlsx", header=None)

In [21]:
S1_sobrante = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_sobrante.xlsx", header=None)

In [22]:
S1_wc = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S1_wc .xlsx", header=None)

In [23]:
S2_alameda = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_alameda.xlsx", header=None)

In [24]:
S2_alamo = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_alamo.xlsx", header=None)

In [25]:
S2_berkeley = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_berkeley .xlsx", header=None)

In [26]:
S2_crockett = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_crockett.xlsx", header=None)

In [27]:
S2_danville = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_danville.xlsx", header=None)

In [28]:
S2_hercules = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_hercules.xlsx", header=None)

In [29]:
S2_leandro = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_leandro .xlsx", header=None)

In [30]:
S2_lorenzo = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_lorenzo .xlsx", header=None)

In [31]:
S2_moraga = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_moraga.xlsx", header=None)

In [32]:
S2_oakland = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_oakland .xlsx", header=None)

In [33]:
S2_orinda = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_orinda .xlsx", header=None)

In [34]:
S2_pablo = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_pablo.xlsx", header=None)

In [35]:
s2_richmond = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\s2_richmond.xlsx", header=None)

In [36]:
S2_selby = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_selby .xlsx", header=None)

In [37]:
S2_sobrante = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_sobrante.xlsx", header=None)

In [38]:
S2_wc = pd.read_excel(r"C:\Users\detro\Desktop\Edited_Pj_city_water\ALL\S2_wc.xlsx", header=None)

In [39]:
S2_alameda.head()

,0,1,2,3,4,5,6,7
0,Pseudo ID,BCC,BEGIN_DATE,END_DATE,CCF,ELEVATION_BAND,CITY_NAME,ZIP_CODE
1,94501-1,8800,12/8/2015,2/10/2016,4.000,1,Alameda,945014615
2,94501-1,8800,2/10/2016,4/9/2016,4.000,1,Alameda,945014615
3,94501-1,8800,10/7/2015,12/8/2015,5.000,1,Alameda,945014615
4,94501-1,8800,8/7/2015,10/7/2015,4.000,1,Alameda,945014615

In [ ]:
#Drop first row of S2 dataframes to remove residual header information.

In [40]:
S2_alameda = S2_alameda.iloc[1:]

In [41]:
#Checking that the method worked. 
S2_alameda.head()

         0     1          2          3      4  5        6          7
1  94501-1  8800  12/8/2015  2/10/2016  4.000  1  Alameda  945014615
2  94501-1  8800  2/10/2016   4/9/2016  4.000  1  Alameda  945014615
3  94501-1  8800  10/7/2015  12/8/2015  5.000  1  Alameda  945014615
4  94501-1  8800   8/7/2015  10/7/2015  4.000  1  Alameda  945014615
5  94501-1  8800   6/9/2015   8/7/2015  3.000  1  Alameda  945014615

In [ ]:
#Drop for the rest of S2.

In [42]:
S2_alamo = S2_alamo.iloc[1:]
S2_berkeley = S2_berkeley.iloc[1:]
S2_crockett = S2_crockett.iloc[1:]
S2_danville = S2_danville.iloc[1:]
S2_hercules = S2_hercules.iloc[1:]
S2_leandro = S2_leandro.iloc[1:]
S2_lorenzo = S2_lorenzo.iloc[1:]
S2_moraga = S2_moraga.iloc[1:]
S2_oakland = S2_oakland.iloc[1:]
S2_orinda = S2_orinda.iloc[1:]
S2_pablo = S2_pablo.iloc[1:]
s2_richmond = s2_richmond.iloc[1:]
S2_selby = S2_selby.iloc[1:]
S2_sobrante = S2_sobrante.iloc[1:]
S2_wc = S2_wc.iloc[1:]

In [43]:
#Checking to make sure method worked properly. 
S2_hercules.head()

         0     1          2          3       4  5         6          7
1  94547-2  8800   6/2/2015  7/31/2015  20.000  1  Hercules  945471651
2  94547-2  8800  7/31/2015  9/30/2015  19.000  1  Hercules  945471651
3  94547-2  8800  9/30/2015  12/1/2015  10.000  1  Hercules  945471651
4  94547-2  8800  12/1/2015   2/2/2016   2.000  1  Hercules  945471651
5  94547-2  8800   2/2/2016   4/1/2016   7.000  1  Hercules  945471651

In [44]:
S2_moraga.head()

         0     1          2          3       4  5       6          7
1  94556-1  8800   2/5/2016   4/5/2016  13.000  2  Moraga  945561026
2  94556-1  8800  12/3/2015   2/5/2016  32.000  2  Moraga  945561026
3  94556-1  8800  10/2/2015  12/3/2015   8.000  2  Moraga  945561026
4  94556-1  8800   8/4/2015  10/2/2015   9.000  2  Moraga  945561026
5  94556-1  8800   6/4/2015   8/4/2015   9.000  2  Moraga  945561026

In [45]:
# Concat the data frames into a single new frame named water_use

frames = [S1_alameda, S1_alamo, S1_berkley, S1_crockett, S1_danville, S1_hercules, S1_leandro, S1_lorenzo, S1_moraga, 
         S1_oakland_a1, S1_oakland_a2, S1_oakland_a3, S1_oakland_b1, S1_oakland_b2, S1_oakland_b3 , S1_orinda, S1_pablo, 
         S1_richmond, S1_selby, S1_sobrante, S1_wc, S2_alameda, S2_alamo, S2_berkeley, S2_crockett, S2_danville, S2_hercules, 
         S2_leandro, S2_lorenzo, S2_moraga, S2_oakland, S2_orinda, S2_pablo, s2_richmond, S2_selby, S2_sobrante, S2_wc]
water_use = pd.concat(frames)

In [46]:
# Count in order to see if we have an appropriate number of rows. We 10.5 million rows, seems correct. 

water_use.count(axis=1)

0         8
1         8
2         8
3         8
4         8
         ..
108299    8
108300    8
108301    8
108302    8
108303    8
Length: 10544323, dtype: int64

In [47]:
water_use.head(10)

,0,1,2,3,4,5,6,7
0,94502-4797,8800,2012-04-05 00:00:00,2012-06-05 00:00:00,26,1,Alameda,945027714
1,94502-4797,8800,2012-06-05 00:00:00,2012-08-03 00:00:00,32,1,Alameda,945027714
2,94502-4797,8800,2012-08-03 00:00:00,2012-10-03 00:00:00,30,1,Alameda,945027714
3,94502-4797,8800,2012-10-03 00:00:00,2012-12-04 00:00:00,21,1,Alameda,945027714
4,94502-4797,8800,2012-12-04 00:00:00,2013-02-05 00:00:00,20,1,Alameda,945027714
5,94502-4797,8800,2013-02-05 00:00:00,2013-04-08 00:00:00,29,1,Alameda,945027714
6,94502-4797,8800,2013-04-08 00:00:00,2013-06-07 00:00:00,26,1,Alameda,945027714
7,94502-4797,8800,2013-06-07 00:00:00,2013-08-06 00:00:00,30,1,Alameda,945027714
8,94502-4797,8800,2013-08-06 00:00:00,2013-10-04 00:00:00,32,1,Alameda,945027714
9,94502-4797,8800,2013-10-04 00:00:00,2013-12-03 00:00:00,35,1,Alameda,945027714

In [48]:
dups = water_use[water_use.duplicated()]

In [49]:
# we have 628 duplicated columns we need to remove
dups.count()

0    628
1    628
2    628
3    628
4    628
5    628
6    628
7    628
dtype: int64

In [50]:
dups.head()

,0,1,2,3,4,5,6,7
16620,94502-3171,6513,2012-06-11 00:00:00,2012-08-10 00:00:00,243,1,Alameda,945027009
28390,94502-3165,6513,2014-10-08 00:00:00,2014-10-17 00:00:00,0,1,Alameda,945026856
218997,94501-29881,8800,2012-10-02 00:00:00,2012-10-16 00:00:00,3,1,Alameda,945015966
91262,94706-899,6513,2013-12-20 00:00:00,2014-01-22 00:00:00,0,1,Albany,947062226
91264,94706-899,6513,2014-01-22 00:00:00,2014-02-21 00:00:00,0,1,Albany,947062226

In [51]:
water_use = water_use.drop_duplicates()

In [52]:
water_use.count(axis=1)

0         8
1         8
2         8
3         8
4         8
         ..
108299    8
108300    8
108301    8
108302    8
108303    8
Length: 10543695, dtype: int64

In [53]:
# check nummber of duplicates droped, should equal 628
10544323 -10543695

628

In [54]:
water_use.isnull().values.any()

True

In [55]:
water_use.isnull().sum().sum()

101

In [56]:
# Since we have such a large data set and so few null values, we will just drop these rows. If circumstances were different,
# we might consider inserting the averages from their respective cities/time series. 

water_use.dropna(how='any', inplace=True)

In [57]:
water_use.isnull().sum().sum()

0

In [58]:
water_use.count(axis=1)

0         8
1         8
2         8
3         8
4         8
         ..
108299    8
108300    8
108301    8
108302    8
108303    8
Length: 10543594, dtype: int64

In [59]:
# verify number of drops matches number of nulls
10543695 -10543594

101

In [60]:
water_use.head()

,0,1,2,3,4,5,6,7
0,94502-4797,8800,2012-04-05 00:00:00,2012-06-05 00:00:00,26,1,Alameda,945027714
1,94502-4797,8800,2012-06-05 00:00:00,2012-08-03 00:00:00,32,1,Alameda,945027714
2,94502-4797,8800,2012-08-03 00:00:00,2012-10-03 00:00:00,30,1,Alameda,945027714
3,94502-4797,8800,2012-10-03 00:00:00,2012-12-04 00:00:00,21,1,Alameda,945027714
4,94502-4797,8800,2012-12-04 00:00:00,2013-02-05 00:00:00,20,1,Alameda,945027714

In [61]:
water_use.columns = ['Pseudo_Id', 'Customer_Type', 'Start_Date', 'End_Date', 'Ccf_Used', 'Elevation_Band', 'City', 'Zip_Code' ]

In [62]:
water_use.head()

,Pseudo_Id,Customer_Type,Start_Date,End_Date,Ccf_Used,Elevation_Band,City,Zip_Code
0,94502-4797,8800,2012-04-05 00:00:00,2012-06-05 00:00:00,26,1,Alameda,945027714
1,94502-4797,8800,2012-06-05 00:00:00,2012-08-03 00:00:00,32,1,Alameda,945027714
2,94502-4797,8800,2012-08-03 00:00:00,2012-10-03 00:00:00,30,1,Alameda,945027714
3,94502-4797,8800,2012-10-03 00:00:00,2012-12-04 00:00:00,21,1,Alameda,945027714
4,94502-4797,8800,2012-12-04 00:00:00,2013-02-05 00:00:00,20,1,Alameda,945027714

In [63]:
#Next lets change the customer_types from intigers to a desriptive object string

water_use['Customer_Type'].unique()

array([8800, 6513, 6514, '8800', '5300', '6514', '6513', '7900', '6800',
       '7500', '5812', '7200', '7950', '8000', '4400', '7260', '5811',
       '2051', '4200', '4950', '8200', '5400', '7990', '8600', '5813',
       '5540', '4800', '7020', '0100', '1500', '2820', '7600', '4900',
       '0700', '2900', '7300', '7215', '2500', '3590', '7001', '3400',
       '3730', '7542', '2700', '2300', '3200', '7216', '8060', '3700',
       '5000', '7000', '4500', '2050', '7210', '3900', '2090', '7940',
       '2891', 'BCC', '3600', '4100', '2830', '6500', '3500', '2060',
       '3800', '3300', '4700', '3470', '2850', '2010', '7342', '2400',
       '4000', '2080', '2810', '2040', '7218', '2011', '5093', '2840',
       '2030', '2600', '3000', '7539', '1200', '7699', '2020', '2860'],
      dtype=object)

In [64]:
water_use = water_use.astype({'Customer_Type':'string'})

In [ ]:
import numpy as np

In [65]:
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['8800'], 'Res_Single_Family')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['6514'], 'Res_Multiple_Dwelling')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['6513'], 'Res_Apartments')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2010'], 'Com_Meat_Products')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2011'], 'Com_Slaughterhouses')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2020'], 'Com_Dairy Product Processing')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2030'], 'Com_Fruit_Vegetable_Processing')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2040'], 'Com_Grain_Mills')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2050'], 'Com_Bakeries')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2060'], 'Com_Sugar_Processing')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2077'], 'Com_Rendering_Tallow')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2080'], 'Com_Beverage_Manufacturing')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2090'], 'Com_Specialty_Foods_Manufacturing')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2600'], 'Com_Paper_Products')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2910'], 'Com_Inorganic_Chemicals_Manufacturing')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2820'], 'Com_Synthetic_Materials_Manufacturing')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2830'], 'Com_Drug_Manufacturing')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2840'], 'Com_Cleaning_Products')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2850'], 'Com_Paint_Manufacturing')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['2893'], 'Com_Ink_Pigment_Manufacturing')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['3110'], 'Com_Leather_Tanning_Finishing')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['3200'], 'Com_Earthware_Manufacturing')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['3300'], 'Com_Primary_Metals_Manufacturing')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['3400'], 'Com_Metal_Products_Manufacturing')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['3410'], 'Com_Drum_Barrel_Manufacturing')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['3470'], 'Com_Metal_Coating')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['4500'], 'Com_Air_Transportation')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['4951'], 'Com_Groundwater_Remediation')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['5812'], 'Com_Food_Service_Establishments')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['7000'], 'Com_Hotels_Motels_Food_Service')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['7210'], 'Com_Laundries')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['7215'], 'Com_Laundromats')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['7218'], 'Com_Industrial_Laundries')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['7300'], 'Com_Laboratories')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['7542'], 'Com_Auto_Wash')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['8060'], 'Hospitals')
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['8060'], 'Schools')

In [66]:
water_use['Customer_Type'].unique()

<StringArray>
[                    'Res_Single_Family',
                        'Res_Apartments',
                 'Res_Multiple_Dwelling',
                                  '5300',
                                  '7900',
                                  '6800',
                                  '7500',
       'Com_Food_Service_Establishments',
                                  '7200',
                                  '7950',
                                  '8000',
                                  '4400',
                                  '7260',
                                  '5811',
                                  '2051',
                                  '4200',
                                  '4950',
                                  '8200',
                                  '5400',
                                  '7990',
                                  '8600',
                                  '5813',
                                  '5540',
                                  '4800',
                                  '7020',
                                  '0100',
                                  '1500',
 'Com_Synthetic_Materials_Manufacturing',
                                  '7600',
                                  '4900',
                                  '0700',
                                  '2900',
                      'Com_Laboratories',
                       'Com_Laundromats',
                                  '2500',
                                  '3590',
                                  '7001',
      'Com_Metal_Products_Manufacturing',
                                  '3730',
                         'Com_Auto_Wash',
                                  '2700',
                                  '2300',
           'Com_Earthware_Manufacturing',
                                  '7216',
                             'Hospitals',
                                  '3700',
                                  '5000',
        'Com_Hotels_Motels_Food_Service',
                'Com_Air_Transportation',
                          'Com_Bakeries',
                         'Com_Laundries',
                                  '3900',
     'Com_Specialty_Foods_Manufacturing',
                                  '7940',
                                  '2891',
                                   'BCC',
                                  '3600',
                                  '4100',
                'Com_Drug_Manufacturing',
                                  '6500',
                                  '3500',
                  'Com_Sugar_Processing',
                                  '3800',
      'Com_Primary_Metals_Manufacturing',
                                  '4700',
                     'Com_Metal_Coating',
               'Com_Paint_Manufacturing',
                     'Com_Meat_Products',
                                  '7342',
                                  '2400',
                                  '4000',
            'Com_Beverage_Manufacturing',
                                  '2810',
                       'Com_Grain_Mills',
              'Com_Industrial_Laundries',
                   'Com_Slaughterhouses',
                                  '5093',
                 'Com_Cleaning_Products',
        'Com_Fruit_Vegetable_Processing',
                    'Com_Paper_Products',
                                  '3000',
                                  '7539',
                                  '1200',
                                  '7699',
          'Com_Dairy Product Processing',
                                  '2860']
Length: 86, dtype: string

In [67]:
#We have a bunch of numerical codes that we have no reference for, we will list these as 'Misc_Other'
water_use['Customer_Type'] = water_use['Customer_Type'].replace(['5300', '7900', '6800', '7500', '7200', '7950', '8000', '4400', '7260', '5811', '2051', '4200', '4950', 
'8200', '5400', '7990', '8600', '5813', '5540', '4800', '7020', '0100', '1500', '7600', '4900', '0700', 
'2900', '2500', '3590', '7001', '3730', '2700', '2300', '7216', '3700', '5000', '3900', '7940', '2891', 
'BCC', '3600', '4100', '6500', '3500', '3800', '4700', '7342', '2400', '4000', '2810', '5093', '3000', 
'7539', '1200' ,'7699' ,'2860'], 'Misc_Other')

In [68]:
water_use['Customer_Type'].unique()

<StringArray>
[                    'Res_Single_Family',
                        'Res_Apartments',
                 'Res_Multiple_Dwelling',
                            'Misc_Other',
       'Com_Food_Service_Establishments',
 'Com_Synthetic_Materials_Manufacturing',
                      'Com_Laboratories',
                       'Com_Laundromats',
      'Com_Metal_Products_Manufacturing',
                         'Com_Auto_Wash',
           'Com_Earthware_Manufacturing',
                             'Hospitals',
        'Com_Hotels_Motels_Food_Service',
                'Com_Air_Transportation',
                          'Com_Bakeries',
                         'Com_Laundries',
     'Com_Specialty_Foods_Manufacturing',
                'Com_Drug_Manufacturing',
                  'Com_Sugar_Processing',
      'Com_Primary_Metals_Manufacturing',
                     'Com_Metal_Coating',
               'Com_Paint_Manufacturing',
                     'Com_Meat_Products',
            'Com_Beverage_Manufacturing',
                       'Com_Grain_Mills',
              'Com_Industrial_Laundries',
                   'Com_Slaughterhouses',
                 'Com_Cleaning_Products',
        'Com_Fruit_Vegetable_Processing',
                    'Com_Paper_Products',
          'Com_Dairy Product Processing']
Length: 31, dtype: string

In [83]:
water_use[["Ccf_Used"]] = water_use[["Ccf_Used"]].apply(pd.to_numeric)

ValueError: Unable to parse string "CCF" at position 8276359

In [93]:
water_use.iloc[[8276359]]

,Pseudo_Id,Customer_Type,Start_Date,End_Date,Ccf_Used,Elevation_Band,City,Zip_Code
1,Pseudo ID,Misc_Other,BEGIN_DATE,END_DATE,CCF,ELEVATION_BAND,CITY_NAME,ZIP_CODE

In [92]:
water_use = water_use.drop(labels=8276359, axis=0, inplace = True)

KeyError: '[8276359] not found in axis'

In [89]:
water_use.head()

,Pseudo_Id,Customer_Type,Start_Date,End_Date,Ccf_Used,Elevation_Band,City,Zip_Code
0,94502-4797,Res_Single_Family,2012-04-05 00:00:00,2012-06-05 00:00:00,26,1,Alameda,945027714
1,94502-4797,Res_Single_Family,2012-06-05 00:00:00,2012-08-03 00:00:00,32,1,Alameda,945027714
2,94502-4797,Res_Single_Family,2012-08-03 00:00:00,2012-10-03 00:00:00,30,1,Alameda,945027714
3,94502-4797,Res_Single_Family,2012-10-03 00:00:00,2012-12-04 00:00:00,21,1,Alameda,945027714
4,94502-4797,Res_Single_Family,2012-12-04 00:00:00,2013-02-05 00:00:00,20,1,Alameda,945027714

In [95]:
water_use = water_use.drop(water_use.index[8276359])

In [96]:
water_use.iloc[[8276359]]

,Pseudo_Id,Customer_Type,Start_Date,End_Date,Ccf_Used,Elevation_Band,City,Zip_Code
26,94546-2,Res_Single_Family,6/22/2015,8/20/2015,8.000,2,Castro Valley,945462964

In [97]:
water_use[["Ccf_Used"]] = water_use[["Ccf_Used"]].apply(pd.to_numeric)

In [99]:
water_use['Ccf_Used'] = water_use['Ccf_Used'].astype(int)

In [101]:
water_use = water_use.astype({'Zip_Code':'int'})

In [103]:
water_use = water_use.astype({'Elevation_Band':'int'})

In [104]:
water_use.dtypes

Pseudo_Id         object
Customer_Type     string
Start_Date        object
End_Date          object
Ccf_Used           int32
Elevation_Band     int32
City              object
Zip_Code           int32
dtype: object

In [107]:
water_use = water_use.astype({'Pseudo_Id':'string'})

In [108]:
water_use.dtypes

Pseudo_Id         string
Customer_Type     string
Start_Date        object
End_Date          object
Ccf_Used           int32
Elevation_Band     int32
City              object
Zip_Code           int32
dtype: object

In [117]:
water_use.head()

,Pseudo_Id,Customer_Type,Start_Date,End_Date,Ccf_Used,Elevation_Band,City,Zip_Code,Gallons_Used,Billed_Days,Gallons_Used_Daily
0,94502-4797,Res_Single_Family,2012-04-05,2012-06-05,26,1,Alameda,945027714,19448,61,318.819672
2,94502-4797,Res_Single_Family,2012-08-03,2012-10-03,30,1,Alameda,945027714,22440,61,367.868852
3,94502-4797,Res_Single_Family,2012-10-03,2012-12-04,21,1,Alameda,945027714,15708,62,253.354839
4,94502-4797,Res_Single_Family,2012-12-04,2013-02-05,20,1,Alameda,945027714,14960,63,237.460317
5,94502-4797,Res_Single_Family,2013-02-05,2013-04-08,29,1,Alameda,945027714,21692,62,349.870968

,Pseudo_Id,Customer_Type,Start_Date,End_Date,Ccf_Used,Elevation_Band,City,Zip_Code
109,94502-1870,Res_Single_Family,2013-04-12 00:00:00,2013-06-12 00:00:00,18,1,Alameda,945026517

In [112]:
water_use['Gallons_Used'] = (water_use['Ccf_Used'] * 748)

In [114]:
water_use[['Start_Date','End_Date']] = water_use[['Start_Date','End_Date']].apply(pd.to_datetime) 
water_use['Billed_Days'] = (water_use['End_Date'] - water_use['Start_Date']).dt.days

In [116]:
water_use['Gallons_Used_Daily'] = (water_use['Gallons_Used']) / (water_use['Billed_Days'])